fix split
